<script setup>
const variables = {
  origin: location.origin,
  privacyPath: location.pathname,
};
</script>

<template>
  <div class="privacy">
    <h1>Политика в отношении обработки персональных данных</h1>
    <ol>
      <li class="privacy__level1">
        <h2>Общие положения</h2>
        <ol>
          <!-- prettier-ignore -->
          <li>Настоящая Политика конфиденциальности (далее – “Политика”)
            разработана ИП Близнюк Светлана Юрьевна (далее – “Оператор”, “Сайт”,
            “Мы”) в соответствии с действующим законодательством Республики
            Беларусь, в частности Закона Республики Беларусь от 07.05.2021 г. №
            99-З “О защите персональных данных”, Закона Республики Беларусь от
            10.11.2008 г. № 455-З “Об информации, информатизации и защите
            информации”, Закона Республики Беларусь от 21.07.2008 г. № 418-З “О
            регистре населения” и устанавливает порядок обработки персональных и
            иных данных с помощью сайта <a href="/">{{ variables.origin }}</a>.
          </li>
          <!-- prettier-ignore -->
          <li>Настоящая Политика использует термины в значениях, установленных
            Законом Республики Беларусь от 07.05.2021 г. № 99-З “О защите
            персональных данных”.
          </li>
          <!-- prettier-ignore -->
          <li>Под персональными данными понимается любая информация, относящаяся к
            идентифицированному физическому лицу или физическому лицу, которое
            может быть идентифицировано.
          </li>
          <!-- prettier-ignore -->
          <li>Под обработкой персональных и иных данных понимается любое действие
            или совокупность действий, совершаемые с персональными данными,
            включая сбор, систематизацию, хранение, изменение, использование,
            обезличивание, блокирование, распространение, предоставление,
            удаление персональных и иных данных.
          </li>
        </ol>
      </li>

      <li class="privacy__level1">
        <h2>Цели обработки персональных и иных данных</h2>
        <p>Оператор обрабатывает персональные данные с целью:</p>
        <ol>
          <!-- prettier-ignore -->
          <li>Рассылки информации (уведомления о новых возможностях, акциях и
            других новостях);
          </li>
          <!-- prettier-ignore -->
          <li>Осуществления коммуникации с субъектами персональных данных;</li>
          <!-- prettier-ignore -->
          <li>Обработки обращений и запросов от субъектов персональных данных.</li>
        </ol>
      </li>

      <li class="privacy__level1">
        <h2>Перечень обрабатываемых персональных и иных данных</h2>
        <p>Сайт осуществляет сбор и обработку следующих персональных данных:</p>
        <ol>
          <!-- prettier-ignore -->
          <li>имя;</li>
          <!-- prettier-ignore -->
          <li>контактные телефоны;</li>
          <!-- prettier-ignore -->
          <li>адрес электронной почты.</li>
        </ol>
      </li>

      <li class="privacy__level1">
        <h2>Порядок получения согласия на обработку персональных данных</h2>
        <ol>
          <!-- prettier-ignore -->
          <li>Основанием для обработки персональных данных является согласие
            субъекта персональных данных, за исключением случаев, когда
            обработка персональных данных осуществляется без получения такого
            согласия.
          </li>
          <!-- prettier-ignore -->
          <li>Согласие субъекта персональных данных на обработку данных происходит
            в форме проставления субъектом соответствующей отметки (“галочки” в
            поле) на интернет-ресурсе (при регистрации, при намерении
            осуществить покупку, в личном кабинете).
          </li>
          <!-- prettier-ignore -->
          <li>Отказ в даче согласия дает право Оператору отказать субъекту
            персональных данных в предоставлении доступа к сайту и сервисам
            Портала.
          </li>
          <!-- prettier-ignore -->
          <li>Пользователи могут предоставлять данные самостоятельно путем
            размещения таких данных на сайте (в том числе путем заполнения полей
            в личном кабинете), а также используя свои аккаунты в социальных
            сетях, аккаунт Google, мобильное приложение, предоставляя таким
            образом доступ к своим данным.
          </li>
          <!-- prettier-ignore -->
          <li>Также данные могут быть сообщены через каналы телефонной связи, на
            электронный или почтовый адрес Оператора, путем заполнения
            опросников (анкет) или другим способом.
          </li>
          <!-- prettier-ignore -->
          <li>Данные также могут предоставляться из других источников например, по
            отзывам пользователей (оценка, комментарии, подтверждение
            информации), другая информация от третьих лиц, представленная в ходе
            направления претензий, жалоб, при рассмотрении споров, информация из
            общеизвестных источников в сети Интернет.
          </li>
          <!-- prettier-ignore -->
          <li>Портал имеет право обрабатывать персональные данные без согласия
            субъекта персональных данных при получении персональных данных на
            основании договора, заключенного (заключаемого) с субъектом
            персональных данных, в целях совершения действий, установленных этим
            договором, а также при обработке персональных данных, когда они
            указаны в документе, адресованном Оператору и подписанном субъектом
            персональных данных, в соответствии с содержанием такого документа.
          </li>
        </ol>
      </li>

      <li class="privacy__level1">
        <h2>Обработка персональных и иных данных</h2>
        <ol>
          <!-- prettier-ignore -->
          <li>Обработка персональных и иных данных осуществляется Оператором в
            соответствии с заявленными целями их обработки.
          </li>
          <!-- prettier-ignore -->
          <li>Персональные и иные данные могут обрабатываться лицом,
            уполномоченным Оператором, на основании договора. При этом
            ответственность перед субъектом персональных данных за действия
            такого лица несет Оператор.
          </li>
          <!-- prettier-ignore -->
          <li>Также Портал обрабатывает и имеет право передавать персональные и
            иные данные третьим сторонам, которые оказывают Порталу услуги,
            связанные с обеспечением функционирования сервисов Портала и сайта.
          </li>
          <!-- prettier-ignore -->
          <li>При этом третьим лицам, указанным в настоящем разделе, персональные
            и иные данные передаются в объеме, требуемом лишь для совершения
            данного конкретного действия (действий).
          </li>
          <!-- prettier-ignore -->
          <li>Персональные и иные данные хранятся Порталом не дольше, чем того
            требуют цели обработки таких данных, кроме случаев установления иных
            сроков законодательством.
          </li>
          <!-- prettier-ignore -->
          <li>Портал не обрабатывает специальные (в т.ч. биометрические
            персональные данные).
          </li>
          <!-- prettier-ignore -->
          <li>Портал не осуществляет трансграничную передачу персональных и иных
            данных.
          </li>
        </ol>
      </li>

      <li class="privacy__level1">
        <h2>Механизм реализации прав субъекта персональных данных</h2>
        <ol>
          <!-- prettier-ignore -->
          <li>Субъект персональных данных вправе в любое время без объяснения
            причин отозвать свое согласие посредством подачи Оператору заявления
            в письменной форме, направленного заказным почтовым отправлением,
            либо в виде электронного документа.
          </li>
          <!-- prettier-ignore -->
          <li>Заявление субъекта персональных данных должно содержать:
            <ul>
              <!-- prettier-ignore -->
               <li>фамилию, собственное имя, отчество (если таковое имеется);</li>
              <!-- prettier-ignore -->
               <li>адрес его места жительства (места пребывания);</li>
              <!-- prettier-ignore -->
               <li>дату рождения;</li>
              <!-- prettier-ignore -->
               <li>идентификационный номер (при отсутствии такого номера - номер
                  документа, удостоверяющего личность) (если указывался при даче
                  согласия Оператору или обработка персональных данных
                  осуществляется без согласия субъекта персональных данных);
              </li>
              <!-- prettier-ignore -->
               <li>изложение сути требований;</li>
              <!-- prettier-ignore -->
               <li>личную подпись либо электронную цифровую подпись.</li>
            </ul>
          </li>
          <!-- prettier-ignore -->
          <li id="stop-privacy">Оператор в течение 15 дней после получения заявления 
              прекращает обработку персональных данных, осуществляет их удаление, а 
              при отсутствии технической возможности удаления - принимает меры по
              недопущению дальнейшей обработки персональных данных, включая их
              блокирование. О принятых мерах Оператор уведомляет субъекта в тот
              же срок.
          </li>

          <!-- prettier-ignore -->
          <li>Субъект персональных данных имеет право на получение информации,
            касающейся обработки своих персональных данных, путем подачи
            Оператору заявления в порядке
            <a href="#stop-privacy">п. 6.3</a> настоящей Политики. Оператор в
            течение пяти рабочих дней после получения заявления предоставляет
            информацию либо уведомляет о причинах отказа в ее предоставлении.
          </li>
          <!-- prettier-ignore -->
          <li>Субъект персональных данных вправе требовать от Оператора внесения
            изменений в свои персональные данные в случае, если персональные
            данные являются неполными, устаревшими или неточными, путем подачи
            Оператору заявления в порядке
            <a href="#stop-privacy">п. 6.3</a> настоящей Политики, с приложением
            документов и (или) их заверенных копий. Оператор в пятнадцатидневный
            срок вносит изменения в персональные данные с последующим
            уведомлением либо уведомляет о причинах отказа.
          </li>
          <!-- prettier-ignore -->
          <li>Субъект персональных данных вправе получать от Оператора информацию
            о предоставлении своих персональных данных третьим лицам один раз в
            календарный год бесплатно путем подачи заявления Оператору в порядке
            <a href="#stop-privacy">п. 6.3</a> настоящей Политики. Оператор обязан в пятнадцатидневный срок
            предоставить информацию о том, какие персональные данные субъекта и
            кому предоставлялись в течение года, предшествовавшего дате подачи
            заявления, либо уведомить о причинах отказа в предоставлении.
          </li>
          <!-- prettier-ignore -->
          <li>Субъект персональных данных вправе требовать от Оператора
            бесплатного прекращения обработки своих персональных данных, включая
            их удаление, при отсутствии оснований для обработки персональных
            данных путем подачи Оператору заявления в порядке
            <a href="#stop-privacy">п. 6.3</a> настоящей Политики. Оператор
            обязан в пятнадцатидневный срок прекратить обработку персональных
            данных, осуществить их удаление, а при отсутствии технической
            возможности удаления - принять меры по недопущению дальнейшей
            обработки персональных данных, включая их блокирование. О принятых
            мерах Оператор уведомляет субъекта в тот же срок.
          </li>
        </ol>
      </li>

      <li class="privacy__level1">
        <h2>Заключительные положения</h2>
        <ol>
          <!-- prettier-ignore -->
          <li>Вопросы, не урегулированные настоящей Политикой, регулируются
            действующим законодательством Республики Беларусь.
          </li>
          <!-- prettier-ignore -->
          <li>Портал имеет право по своему усмотрению в любое время изменять,
            дополнять, исключать условия настоящей Политики без уведомления (как
            предварительного, так и последующего) субъектов персональных и иных
            данных.
          </li>
          <!-- prettier-ignore -->
          <li>Настоящая Политика размещена по адресу
            <a :href="variables.privacyPath">{{
              variables.origin + variables.privacyPath
            }}</a
            >.
          </li>
        </ol>
      </li>
    </ol>
    <hr>
    <p style="text-align: left;">
      Полный текст Закона Республики Беларусь от 07.05.2021&#8239;г. №99-З “О защите
      персональных данных” можно прочитать тут: 
      <a href="https://pravo.by/upload/docs/op/H12100099_1620939600.pdf"
        >pravo.by</a
      >
    </p>
  </div>
</template>

<style lang="scss" scoped>
@import "@/assets/vars";

.privacy {
  max-width: $wrapper-width;
  margin: 0 auto;
  padding: 50px 0;
  color: $on-surface;
  text-align: justify;

  @include breakpoint(lg) {
    padding: 50px 16px;
  }

  h1 {
    font-size: $header1;
    font-weight: $font-bold;
    text-align: left;

    @include breakpoint(sm) {
      font-size: $header1-mobile;
    }
  }

  h2 {
    font-size: $header2;
    font-weight: $font-medium;
    text-align: left;
    margin: 25px 0 16px;

    @include breakpoint(sm) {
      font-size: $header2-mobile;
      margin: 20px 0 10px;
    }
  }

  p {
    font-size: $paragraph-lg;
    font-weight: $font-regular;
    margin-bottom: 20px;

    @include breakpoint(sm) {
      font-size: $paragraph;
    }
  }

  ol {
    counter-reset: item;

    & > li {
      display: block;
      font-size: $paragraph-lg;
      font-weight: $font-regular;
      margin-bottom: 1.6rem;
      padding-left: 3rem;
      // scroll-margin-top: calc($navbar-height + 10px);
      padding-top: 4em; // scroll-margin-top crossbrowser solution
      margin-top: -4em; // scroll-margin-top crossbrowser solution

      @include breakpoint(sm) {
        font-size: $paragraph;
        padding-left: 1rem;
      }

      &::before {
        content: counters(item, ".");
        counter-increment: item;
        font-size: $paragraph;
        padding-right: 1rem;

        @include breakpoint(sm) {
          font-size: $paragraph;
        }
      }
    }

    .privacy__level1 {
      padding-left: 0;

      &::before {
        content: "";
        padding-right: 0;
      }
    }
  }

  ul {
    li {
      list-style: "– " inside;
      padding-left: 4.2rem;
      text-indent: -1.2rem;
      text-align: left;
    }
  }

  a {
    color: $tertiary;
    text-decoration: underline;

    &:hover {
      color: $primary-variant;
    }
  }

  hr {
    height: 1px;
    background-color: $outline;
    margin: 50px 0;
  }
}
</style>
